Repository: SAP/sapmachine-manager-for-macos
Catalog: source/SapMachine Manager/Localizable.xcstrings
Source language: en
Languages: de

# allUsersButton
source: All Users
de: Für alle Benutzer

# cancelButton
source: Cancel
de: Abbrechen

# checkButtonTitle
source: Check for updates
de: Nach Aktualisierungen suchen

# currentUserOnlyButton
source: Current User
de: Für den aktuellen Benutzer

# deleteButton
source: Delete
de: Löschen

# deleteMultipleMainMenuEntry
source: Delete Selected SapMachines (%ld Items)
de: Ausgewählte SapMachine-Versionen löschen (%ld Objekte)

# deleteOneMainMenuEntry
source: Delete Selected SapMachine
de: Ausgewählte SapMachine löschen

# deleteOneMenuEntry
source: Delete this SapMachine
de: Diese SapMachine löschen

# deleteSelectedMenuEntry
source: Delete selected SapMachines (%ld items)
de: Ausgewählte SapMachine-Versionen löschen (%ld Objekte)

# dialogDeleteMessage
source: You can’t undo this action.
de: Diese Aktion kann nicht rückgänging gemacht werden.

# dialogDeleteMultipleTitle
source: Are you sure you want to delete the %ld selected SapMachines from your Mac?
de: Bist Du sicher, dass Du die %ld ausgewählten SapMachine-Versionen von Deinem Mac löschen willst?

# dialogDeleteOneTitle
source: Are you sure you want to delete "%@" from your Mac?
de: Bist Du sicher, dass Du "%@" von Deinem Mac löschen willst?

# dialogDeletionMultipleFailedMessage
source: An error occurred while deleting the selected SapMachines from your Mac. Please check the log for details.
de: Beim Versuch, die ausgewählten SapMachine-Versionen von Deinem Mac zu löschen, ist ein Fehler aufgetreten. Einzelheiten kannst Du dem Protokoll entnehmen.

# dialogDeletionMultipleFailedTitle
source: Some of the selected SapMachines could not be deleted!
de: Einige der ausgewählten SapMachine-Versionen konnten nicht gelöscht werden!

# dialogDeletionOneFailedMessage
source: An error occurred while deleting the SapMachine from your Mac. Please check the log for details.
de: Beim Versuch, SapMachine von Deinem Mac zu löschen, ist ein Fehler aufgetreten. Einzelheiten kannst Du dem Protokoll entnehmen.

# dialogDeletionOneFailedTitle
source: SapMachine could not be deleted!
de: SapMachine konnte nicht gelöscht werden!

# dialogFailedToSaveLogMessage
source: An error occurred while writing the log to file. Please check if the location you selected is writable and try again.
de: Beim Schreiben der Protokolldatei ist ein Fehler aufgetreten. Bitte überprüfe, ob der ausgewählte Speicherort korrekt ist und versuche es erneut.

# dialogFailedToSaveLogTitle
source: The log could not be saved!
de: Das Protokoll konnte nicht gespeichert werden!

# dialogLoginItemDisabledMessage
source: This application’s login item needs to be enabled in System Settings for this application to work correctly. Please enable the login item and try again.
de: Das Anmeldeobjekt dieses Programms muss in den Systemeinstellungen aktiviert werden, damit das Programm korrekt funktionieren kann. Bitte aktiviere das Anmeldeobjekt und versuche es erneut.

# dialogLoginItemDisabledTitle
source: Login item not enabled!
de: Anmeldeobjekt ist nicht aktiviert!

# dialogLTSUpgradeDeleteMultiple
source: Delete old releases
de: Alte Versionen löschen

# dialogLTSUpgradeDeleteOne
source: Delete old release
de: Alte Version löschen

# dialogLTSUpgradeMultipleMessage
source: A new major release of SapMachine is available. It’s recommended to upgrade your installed releases to the new version.
de: Eine neue Hauptversion von SapMachine ist verfügbar. Es wird empfohlen, Deine installierten Versionen auf die neue Version zu aktualisieren.

# dialogLTSUpgradeOneMessage
source: A new major release of SapMachine is available. It’s recommended to upgrade your installed release to the new version.
de: Eine neue Hauptversion von SapMachine ist verfügbar. Es wird empfohlen, Deine installierte Version auf die neue Version zu aktualisieren.

# dialogLTSUpgradeTitle
source: Would you like to upgrade to SapMachine %ld?
de: Möchtest Du auf SapMachine %ld aktualisieren?

# dialogMultipleUpdatesFailedMessage
source: Some errors occurred while installing SapMachine updates. Please check the log for details.
de: Bei der Installation mehrerer SapMachine Aktualisierungen sind Fehler aufgetreten. Einzelheiten kannst Du dem Protokoll entnehmen.

# dialogMultipleUpdatesFailedTitle
source: Some updates could not be applied!
de: Einige Aktualisierungen konnten nicht durchgeführt werden!

# dialogNoAssetsCheckbox
source: Install recommended version of SapMachine
de: Empfohlene Version von SapMachine installieren

# dialogNoAssetsMessage
source: SapMachine is not installed on your Mac. If you want to install SapMachine, please click the appropriate button below.
de: SapMachine ist momentan nicht auf Deinem Mac installiert. Wenn Du SapMachine installieren möchtest, klicke bitte auf die entsprechende untenstehende Taste.

# dialogNoAssetsNoAvailableMessage
source: SapMachine is not installed on your Mac. Please install any SapMachine release and run this application again.
de: SapMachine ist momentan nicht auf Deinem Mac installiert. Bitte installiere eine beliebige SapMachine-Version und starte dann dieses Programm erneut.

# dialogNoAssetsNoAvailableTitle
source: SapMachine is not installed!
de: SapMachine ist nicht installiert!

# dialogNoAssetsTitle
source: Would you like to install SapMachine?
de: Möchtest Du SapMachine installieren?

# dialogNothingToInstallMessage
source: There are currently no further SapMachine releases available to install on your Mac.
de: Derzeit sind keine weiteren SapMachine-Versionen für die Installation auf Deinem Mac verfügbar.

# dialogNothingToInstallTitle
source: No further SapMachine releases available!
de: Keine weiteren SapMachine-Versionen verfügbar!

# dialogNothingToPackageMessage
source: There are currently no SapMachine releases available. Please try again later.
de: Derzeit sind keine SapMachine-Versionen verfügbar. Bitte versuche es später noch einmal.

# dialogNothingToPackageTitle
source: No SapMachine releases available!
de: Keine SapMachine-Versionen verfügbar!

# dialogOneUpdateFailedMessage
source: An error occurred while installing a SapMachine update. Please check the log for details.
de: Bei der Installation einer SapMachine Aktualisierung ist ein Fehler aufgetreten. Einzelheiten kannst Du dem Protokoll entnehmen.

# dialogOneUpdateFailedTitle
source: An update could not be applied!
de: Eine Aktualisierung konnte nicht durchgeführt werden!

# dialogSetJavaHomeMessage
source: You can set the default environment either for the current user or for all users of this Mac. Individual configurations of other users are not affected by the changes.
de: Du kannst die Standardumgebung entweder für den aktuellen Benutzer oder für alle Benutzer dieses Macs setzen. Individuelle Konfigurationen anderer Benutzer sind von den Änderungen nicht betroffen.

# dialogSetJavaHomeTitle
source: For which users should this SapMachine release be used as the default environment?
de: Für welche Benutzer soll diese SapMachine-Version als Standardumgebung verwendet werden?

# dialogUnsetJavaHomeMessage
source: You can reset the default environment either for the current user or for all users of this Mac. Individual configurations of other users are not affected by the changes.
de: Du kannst die Standardumgebung entweder für den aktuellen Benutzer oder für alle Benutzer dieses Macs zurücksetzen. Individuelle Konfigurationen anderer Benutzer sind von den Änderungen nicht betroffen.

# dialogUnsetJavaHomeTitle
source: For which users should the default environment be reset?
de: Für welche Benutzer soll die Standardumgebung zurückgesetzt werden?

# dialogXPCConnectionFailedLoginItemMessage
source: For this application to work correctly, it must connect to a daemon. Therefore this application’s login item needs to be enabled in System Settings which is currently not the case. Please enable the login item and try again.
de: Damit dieses Programm korrekt funktionieren kann, muss es sich mit einem Daemon verbinden. Dafür muss das Anmeldeobjekt dieses Programms in den Systemeinstellungen aktiviert sein, was derzeit nicht der Fall ist. Bitte aktiviere das Anmeldeobjekt und versuche es erneut.

# dialogXPCConnectionFailedMessage
source: For this application to work correctly, it must connect to a daemon. Unfortunately, this connection has failed, so the application must now quit.
de: Damit dieses Programm korrekt funktionieren kann, muss es sich mit einem Daemon verbinden. Leider ist diese Verbindung fehlgeschlagen, sodass das Programm jetzt beendet werden muss.

# dialogXPCConnectionFailedTitle
source: Failed to connect to daemon!
de: Verbindung zum Daemon fehlgeschlagen!

# errorAssetInUse
source: Could not update SapMachine because it was in use
de: SapMachine konnte nicht aktualisiert werden, weil sie in Benutzung war

# errorChecksum
source: The checksum of the downloaded file could not be successfully verified
de: Die Prüfsumme der heruntergeladenen Datei konnte nicht erfolgreich überprüft werden

# errorNoAssets
source: No assets provided
de: Es wurden keine Objekte angegeben

# errorNoInstallURL
source: No install url provided
de: Es wurde kein Installationspfad angegeben

# errorOperationInProgress
source: Another operation is already in progress
de: Ein anderer Vorgang ist bereits in Gange

# errorUnknown
source: An unknown error occurred
de: Ein unbekannter Fehler ist aufgetreten

# errorUnpackingFailed
source: Failed to unpack downloaded file
de: Die heruntergeladene Datei konnte nicht entpackt werden

# errorUnpackingUnexpected
source: Unpacked downloaded file with unexpected results
de: Das Entpacken der heruntergeladenen Datei lieferte ein unerwartetes Ergebnis

# errorUserNotAuthorizedDelete
source: The current user is not authorized to delete SapMachine releases
de: Der aktuelle Benutzer ist nicht berechtigt, SapMachine zu löschen

# errorUserNotAuthorizedInstall
source: The current user is not authorized to install SapMachine
de: Der aktuelle Benutzer ist nicht berechtigt, SapMachine zu installieren

# installButton
source: Install
de: Installieren

# installMultipleButtonTitle
source: Install available updates
de: Aktualisierungen installieren

# installOneButtonTitle
source: Install update
de: Aktualisierung installieren

# installReleaseSelect
source: Please select the release and type of SapMachine you want to install:
de: Bitte wähle die Version und den Typ der SapMachine, die Du installieren möchtest:

# javaHomeToolTipSystem
source: This SapMachine release is used as the default environment for all users. If a user has defined an individual default environment for themselves, the individual default environment would be used for this user.
de: Diese SapMachine-Version wird als Standardumgebung für alle Benutzer verwendet. Sollte ein Benutzer für sich eine individuelle Standardumgebung festgelegt haben, würde für diesen Benutzer die individuelle Standardumgebung verwendet werden.

# javaHomeToolTipUser
source: This SapMachine release is used as the default environment for the current user only. If a default environment has also been defined that is used for all users, this would be ignored for the current user.
de: Diese SapMachine-Version wird als Standardumgebung nur für den aktuellen Benutzer verwendet. Sollte auch eine Standardumgebung festgelegt worden sein, die für alle Benutzer verwendet wird, würde diese für den aktuellen Benutzer ignoriert werden.

# longTermRelease
source: Long Term Support
de: Langfristiger Support

# multipleUpdatesAvailable
source: There are %ld updates available.
de: Es sind %ld Aktualisierungen verfügbar.

# noUpdatesAvailable
source: SapMachine is up to date on your Mac.
de: SapMachine ist auf Deinem Mac auf dem aktuellen Stand.

# oneUpdateAvailable
source: There is an update available.
de: Es ist eine Aktualisierung verfügbar.

# openSettingsButton
source: Open System Settings
de: Systemeinstellungen öffnen

# packageBuildFinish
source: Successfully prepared package "%@".
de: Das Paket "%@" wurde erfolgreich vorbereitet.

# packageBuildNoScript2Pkg
source: Your package has been prepared but could not be passed to Script2Pkg for package creation. Please check if Script2Pkg is installed in your Mac’s Applications folder and try again. As the source folder of the package is displayed in the Finder, you can use it to create the package manually after installing Script2Pkg.
de: Dein Paket wurde vorbereitet, konnte jedoch nicht an Script2Pkg zur Paketerstellung übergeben werden. Bitte überprüfe, ob Script2Pkg im Programme-Ordner Deines Macs installiert ist und versuche es erneut. Der Quellordner des Pakets wird im Finder angezeigt und kann nach der Installation von Script2Pkg verwendet werden, um das Paket manuell zu erstellen.

# packageBuildPrepare
source: Preparing package…
de: Paket wird vorbereitet …

# packageBuildReleaseSelect
source: Please select the release and type of SapMachine you want to package:
de: Bitte wähle die Version und den Typ der SapMachine, die Du paketieren möchtest:

source: Pre-Release
de: Vorabversion

# quitButton
source: Quit
de: Beenden

# showLogButton
source: Show Log…
de: Protokoll anzeigen …

# statusToolTipUnsupported
source: This version is not supported anymore.
de: Diese Version wird nicht mehr unterstützt.

# statusToolTipUpdateAvailable
source: There’s an update available.
de: Es ist eine Aktualisierung verfügbar.

# statusToolTipUpToDate
source: The current version is installed.
de: Die aktuelle Version ist installiert.

# statusUnsupported
source: This version is not supported anymore and should be deleted from your Mac.
de: Diese Version wird nicht mehr unterstützt und sollte von Deinem Mac gelöscht werden.

# statusUpdateAvailable
source: The installed version %1$@ can be updated to version %2$@.
de: Die installierte Version %1$@ kann auf die Version %2$@ aktualisiert werden.

# statusUpToDate
source: The installed version %@ is the current version.
de: Die installierte Version %@ ist aktuell.

# tryAgainButton
source: Try Again
de: Erneut versuchen

# updateOneMenuEntry
source: Update this SapMachine
de: Diese SapMachine aktualisieren

# updateSelectedMenuEntry
source: Update selected SapMachines (%ld items)
de: Ausgewählte SapMachine-Versionen aktualisieren (%ld Objekte)

# upgradeButton
source: Upgrade
de: Aktualisieren
